Ran Plan for 2 projects:

1. project: `iam/dg-id` dir: `terraform/iam/dg-id` workspace: `default`
1. project: `github/terraform-provisioning` dir: `github/terraform-provisioning` workspace: `default`

### 1. project: `iam/dg-id` dir: `terraform/iam/dg-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_openid_connect_provider.gitaction_idp will be created
+ resource "aws_iam_openid_connect_provider" "gitaction_idp" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "ffffffffffffffffffffffffffffffffffffffff",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.gitaction will be created
+ resource "aws_iam_role" "gitaction" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:daegwan00/springboot-sample:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::545009828941:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gitaction"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.gitaction_ecr will be created
+ resource "aws_iam_role_policy" "gitaction_ecr" {
      + id          = (known after apply)
      + name        = "gitaction-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.gitaction_s3 will be created
+ resource "aws_iam_role_policy" "gitaction_s3" {
      + id          = (known after apply)
      + name        = "gitaction-s3"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAccessS3Bucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ gitaction_arn              = (known after apply)

```

This plan was not saved because one or more projects failed and automerge requires all plans pass.
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. project: `github/terraform-provisioning` dir: `github/terraform-provisioning` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.7.0 init -input=false -no-color -upgrade -backend-config=\"role_arn=arn:aws:iam::066346343248:role/atlantis-dg-id-admin\" -upgrade=false" in "/home/atlantis/.atlantis/repos/daegwan00/terraform-provisioning/8/default/github/terraform-provisioning": exit status 1

Initializing the backend...

Warning: Deprecated Parameters

  on backend.tf line 4, in terraform:
   4:   backend "s3" {

The following parameters have been deprecated. Replace them as follows:
  * role_arn -> assume_role.role_arn



Error: Cannot assume IAM Role

IAM Role (arn:aws:iam::066346343248:role/atlantis-dg-id-admin) cannot be
assumed.

There are a number of possible causes of this - the most common are:
  * The credentials used in order to assume the role are invalid
  * The credentials do not have appropriate permission to assume the role
  * The role ARN is not valid

Error: operation error STS: AssumeRole, https response error StatusCode: 403,
RequestID: d956b2f4-7522-4787-be57-b754714227a8, api error AccessDenied:
User:
arn:aws:sts::545009828941:assumed-role/atlantis-ecs_task_execution/4fb744b889ac4647bc4bc42cd77eb9f7
is not authorized to perform: sts:AssumeRole on resource:
arn:aws:iam::066346343248:role/atlantis-dg-id-admin



```
</details>

---

